---
type: PDFExportOptions
namespace: Autodesk.Revit.DB
version: 2024
members: 27
tags: [revit-api, class]
---

# PDFExportOptions

`Autodesk.Revit.DB.PDFExportOptions` · Revit 2024 · 27 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | PDFExportOptions | 2022 | `public PDFExportOptions ()` |
| Method | Dispose | — | `public void Dispose ()` |
| Method | GetNamingRule | 2022 | `public IList < TableCellCombinedParameterData > GetNamingRule ()` |
| Method | IsValidNamingRule | 2022 | `public static bool IsValidNamingRule ( IList < TableCellCombinedParameterData > namingRule )` |
| Method | SetNamingRule | 2022 | `public void SetNamingRule ( IList < TableCellCombinedParameterData > namingRule )` |
| Property | AlwaysUseRaster | 2022 | `public bool AlwaysUseRaster { get ; set ; }` |
| Property | ColorDepth | 2022 | `public ColorDepthType ColorDepth { get ; set ; }` |
| Property | Combine | 2022 | `public bool Combine { get ; set ; }` |
| Property | ExportQuality | 2022 | `public PDFExportQualityType ExportQuality { get ; set ; }` |
| Property | FileName | 2022 | `public string FileName { get ; set ; }` |
| Property | HideCropBoundaries | 2022 | `public bool HideCropBoundaries { get ; set ; }` |
| Property | HideReferencePlane | 2022 | `public bool HideReferencePlane { get ; set ; }` |
| Property | HideScopeBoxes | 2022 | `public bool HideScopeBoxes { get ; set ; }` |
| Property | HideUnreferencedViewTags | 2022 | `public bool HideUnreferencedViewTags { get ; set ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | MaskCoincidentLines | 2022 | `public bool MaskCoincidentLines { get ; set ; }` |
| Property | OriginOffsetX | 2022 | `public double OriginOffsetX { get ; set ; }` |
| Property | OriginOffsetY | 2022 | `public double OriginOffsetY { get ; set ; }` |
| Property | PaperFormat | 2022 | `public ExportPaperFormat PaperFormat { get ; set ; }` |
| Property | PaperOrientation | 2022 | `public PageOrientationType PaperOrientation { get ; set ; }` |
| Property | PaperPlacement | 2022 | `public PaperPlacementType PaperPlacement { get ; set ; }` |
| Property | RasterQuality | 2022 | `public RasterQualityType RasterQuality { get ; set ; }` |
| Property | ReplaceHalftoneWithThinLines | 2022 | `public bool ReplaceHalftoneWithThinLines { get ; set ; }` |
| Property | StopOnError | 2022 | `public bool StopOnError { get ; set ; }` |
| Property | ViewLinksInBlue | 2022 | `public bool ViewLinksInBlue { get ; set ; }` |
| Property | ZoomPercentage | 2022 | `public int ZoomPercentage { get ; set ; }` |
| Property | ZoomType | 2022 | `public ZoomType ZoomType { get ; set ; }` |